In [3]:
import numbers as np
import pandas as pd

Re-indexing & Altering labels

In [4]:
data={
    'Name':['Alice','Bob','Charlie'],
    'Age':[25,30,35]
}

In [5]:
df=pd.DataFrame(data,index=['a','b','c'])
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [6]:
df.reindex(['c','a','b'])

      Name  Age
c  Charlie   35
a    Alice   25
b      Bob   30

In [7]:
df.reindex(['c','a','b','p'])

      Name   Age
c  Charlie  35.0
a    Alice  25.0
b      Bob  30.0
p      NaN   NaN

In [8]:
df.reindex(['p','q','r'])

  Name  Age
p  NaN  NaN
q  NaN  NaN
r  NaN  NaN

In [9]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [10]:
df.reindex(columns=["Age","Name"])

   Age     Name
a   25    Alice
b   30      Bob
c   35  Charlie

In [11]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

Rename index and columns

In [12]:
df.rename(index={'a':'A', 'p':'P', 'c':'C', 'q':'Q'},columns={'Name':'First Name','Age':"Current Age"})

  First Name  Current Age
A      Alice           25
b        Bob           30
C    Charlie           35

In [13]:
df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

In [14]:
# Directly Replace Index or Column Labels

In [15]:
df.index=['x','y','z']
df.columns=['personName','personAge']

In [16]:
df

  personName  personAge
x      Alice         25
y        Bob         30
z    Charlie         35

In [17]:
print(df.index)

Index(['x', 'y', 'z'], dtype='object')

In [18]:
print(df.columns)

Index(['personName', 'personAge'], dtype='object')

In [19]:
df.reset_index(inplace=True)

In [20]:
df

  index personName  personAge
0     x      Alice         25
1     y        Bob         30
2     z    Charlie         35

In [21]:
df.drop(columns=['index'],inplace=True)

In [22]:
df

  personName  personAge
0      Alice         25
1        Bob         30
2    Charlie         35

Pivoting

In [23]:
data={
    "Date":["2024-01-01","2024-01-01","2024-01-02","2024-01-02"],
    "Product":["Laptop","Mouse","Laptop","Mouse"],
    "Sales":[1200,100,1300,120]
}
df=pd.DataFrame(data)

In [24]:
df.pivot(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [25]:
df.pivot(index="Product",columns="Date",values="Sales")

Date     2024-01-01  2024-01-02
Product
Laptop         1200        1300
Mouse           100         120

In [26]:
df.pivot(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [27]:
df.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1200    100
2024-01-02    1300    120

In [28]:
data2={
    "Date":["2024-01-01","2024-01-01","2024-01-02","2024-01-02","2024-01-01","2024-01-02"],
    "Product":["Laptop","Mouse","Laptop","Mouse","Laptop","Mouse"],
    "Sales":[1200,100,1300,120,560,320],
}

df2=pd.DataFrame(data2)

In [29]:
df2

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120
4  2024-01-01  Laptop    560
5  2024-01-02   Mouse    320

In [30]:
df2.pivot_table(index="Date",columns="Product",values="Sales")

Product     Laptop  Mouse
Date
2024-01-01   880.0  100.0
2024-01-02  1300.0  220.0

In [31]:
df2.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="mean")

Product     Laptop  Mouse
Date
2024-01-01   880.0  100.0
2024-01-02  1300.0  220.0

In [32]:
df2.pivot_table(index="Date",columns="Product",values="Sales",aggfunc="sum")

Product     Laptop  Mouse
Date
2024-01-01    1760    100
2024-01-02    1300    440

In [33]:
df_trans=pd.read_csv("transactions.csv")
df_trans

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857      NaN
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [34]:
df_trans.pivot_table(index="category",columns="name",values="amount",aggfunc="mean")

name      Alice Brown   Bob Wilson  Charlie Davis   John Smith
category
A         1013.098322  1007.145509     978.734140  1016.928494
B          995.399100  1001.289501     989.217648  1022.436821
C          987.403818   982.914803    1028.884271   979.868461

In [35]:
pivot_tbl=df_trans.pivot_table(index="category",columns="name",values="amount",aggfunc="sum")

In [36]:
pivot_tbl

name        Alice Brown     Bob Wilson  Charlie Davis     John Smith
category
A          50654.916080   65464.458093   66553.921547   78303.494025
B          68682.537866   47060.606561   69245.235392   77705.198415
C         131324.707842  105171.883924  132726.070909  111705.004519

In [37]:
print(pivot_tbl["Alice Brown"].sum())

250662.161788

In [38]:
for col in pivot_tbl.columns:
    print(f"{col}=>{pivot_tbl[col].sum()}")

Alice Brown=>250662.161788
Bob Wilson=>217696.948578
Charlie Davis=>268525.227848
John Smith=>267713.696959

groupby() function

In [39]:
data={
    'Department':['IT','IT','HR','HR','Finance','Finance'],
    'Employee':['A','B','C','D','E','F'],
    'Salary':[60000,65000,50000,52000,70000,71000]
}

df_hr=pd.DataFrame(data)

df_hr

  Department Employee  Salary
0         IT        A   60000
1         IT        B   65000
2         HR        C   50000
3         HR        D   52000
4    Finance        E   70000
5    Finance        F   71000

In [40]:
df_hr.groupby(by="Department")

In [41]:
df_hr.groupby(by="Department")["Salary"]

In [42]:
df_hr.groupby(by=["Salary"])

In [43]:
df_hr.groupby("Department")["Salary"].mean()

Department
Finance    70500.0
HR         51000.0
IT         62500.0
Name: Salary, dtype: float64

In [44]:
df_hr.groupby(by=["Department", "Employee"])["Salary"].mean()

Department  Employee
Finance     E           70000.0
            F           71000.0
HR          C           50000.0
            D           52000.0
IT          A           60000.0
            B           65000.0
Name: Salary, dtype: float64

In [45]:
df_hr.groupby(by="Department")["Salary"].agg(["sum", "mean", "count"])

               sum     mean  count
Department
Finance     141000  70500.0      2
HR          102000  51000.0      2
IT          125000  62500.0      2

In [46]:
df_hr.groupby(by="Department")["Salary"].agg(Total_sum='sum',avg='mean',count='count')

            Total_sum      avg  count
Department
Finance        141000  70500.0      2
HR             102000  51000.0      2
IT             125000  62500.0      2

In [52]:
data3={
    "Team":["A","B","C"],
    "Score":["3","15","3"]
}
df_hrr=pd.DataFrame(data3)

df_hrr

  Team Score
0    A     3
1    B    15
2    C     3

In [57]:
# filter groups eith team total score > 35

# total_score=df.groupby('Team')['Score'].sum()

Transform() function

In [58]:
df

         Date Product  Sales
0  2024-01-01  Laptop   1200
1  2024-01-01   Mouse    100
2  2024-01-02  Laptop   1300
3  2024-01-02   Mouse    120

In [61]:
# df['New_scorel']=df['score'].transform(lambda x:x+5)

In [63]:
# df

In [ ]:
# def display(n):
#     return n+1

# df['Dift_score']=df['Score'].transform(disp)

In [ ]:
# df

In [ ]:
# df.drop(columns=['New_score'.Diff_score],inplace=True)

In [65]:
# df

In [ ]:
# df['Avg_score']=df.groupby(by='Team')['Score'].transform('mean')

In [ ]:
# df

In [ ]:
# df.groupby(by="Team")['Score'].apply('mean')